Catalogs/НастройкиДоступаКСайту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>НастройкиДоступаКСайту</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСайта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбменаССайтом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьПароль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайловыйРесурс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидШаблонаСайта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыСайта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыОбменаССайтом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыОбменаССайтом</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Напрямую</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧерезФайловыйРесурс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/НастройкиДоступаКСайту/Forms/ФормаЭлемента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// Обработчик события "ПередОткрытием" формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Организация = ОСМДПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "ОсновнаяОрганизация");
		Объект.ТипОбмена   = Перечисления.ТипыОбменаССайтом.Напрямую;
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
// Обработчик события "ПриОткрытии" формы.
//
Процедура ПриОткрытии(Отказ)
	
	УправлениеФормой();
	
КонецПроцедуры // ПриОткрытии()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ

&НаКлиенте
// Обработчик события "ПриИзменении" поля ввода "ТипОбмена".
//
Процедура ТипОбменаПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры // ТипОбменаПриИзменении()

&НаКлиенте
// Обработчик события "НачалоВыбора" поля ввода "ФайловыйРесурс".
//
Процедура ФайловыйРесурсНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыборКаталога();
	
КонецПроцедуры // ФайловыйРесурсНачалоВыбора()

&НаКлиенте
// Обработчик события "Открытие" поля ввода "ФайловыйРесурс".
//
Процедура ФайловыйРесурсОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	
	ПроверитьНаличиеКаталога();
	
	ЗапуститьПриложение(Объект.ФайловыйРесурс);
	
КонецПроцедуры // ФайловыйРесурсОткрытие()

&НаКлиенте
// Обработчик события "ПриИзменении" флага "ХранитьПароль".
//
Процедура ХранитьПарольПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры // ХранитьПарольПриИзменении()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
// Обработка команды "ПроверитьПодключение".
//
Процедура ПроверитьПодключение(Команда)
	
	Если Объект.Ссылка.Пустая() ИЛИ Модифицированность Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Необходимо записать элемент.';uk='Необхідно записати елемент.'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ Объект.ХранитьПароль Тогда
		Пароль = ОткрытьФормуМодально("ОбщаяФорма.ВебИнтеграцияВводПароля");
	Иначе
		Пароль = Объект.Пароль;
	КонецЕсли;
	
	Если ВебИнтеграцияОбщегоНазначения.ПроверитьПодключениеКСайту(Объект.АдресСайта,
																			 Объект.Логин,
																			 Пароль,,Объект.ВидШаблонаСайта) Тогда
		Сообщить(НСтр("ru='Подключение выполнено успешно.';uk='Підключення виконано успішно.'"));
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось подключиться к сайту.';uk='Не вдалося підключитися до сайту.'"));
	КонецЕсли;
	
КонецПроцедуры // ПроверитьПодключение()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
// Управление видимостью элементов формы.
//
Процедура УправлениеФормой()
	
	Если Объект.ТипОбмена = ПредопределенноеЗначение("Перечисление.ТипыОбменаССайтом.ЧерезФайловыйРесурс") Тогда
		Элементы.ФайловыйРесурс.Видимость         = Истина;
		Элементы.НадписьПояснениеОбмен.Видимость  = Истина;
		Элементы.АдресСайта.ОтметкаНезаполненного = Ложь;
		Элементы.Логин.ОтметкаНезаполненного      = Ложь;
	Иначе
		Элементы.ФайловыйРесурс.Видимость         = Ложь;
		Элементы.НадписьПояснениеОбмен.Видимость  = Ложь;
		Элементы.АдресСайта.ОтметкаНезаполненного = Истина;
		Элементы.Логин.ОтметкаНезаполненного      = Истина;
	КонецЕсли;
	
	Элементы.НадписьХранитьПарольПояснение.Видимость = (НЕ Объект.ХранитьПароль);
	
КонецПроцедуры // УправлениеФормой()

&НаКлиенте
// Процедура выбора каталога.
//
Процедура ВыборКаталога()
	
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	ДиалогВыбораКаталога.Заголовок               = "Выберите каталог";
	ДиалогВыбораКаталога.ПредварительныйПросмотр = Ложь;
	ДиалогВыбораКаталога.ИндексФильтра           = 0;
	ДиалогВыбораКаталога.Каталог                 = Объект.ФайловыйРесурс;
	
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		Объект.ФайловыйРесурс = ДиалогВыбораКаталога.Каталог;
	КонецЕсли;
	
КонецПроцедуры // ВыборКаталога()

&НаСервере
// Проверяет наличие указанного каталога.
//
Процедура ПроверитьНаличиеКаталога()
	
	//СправочникОбъект = РеквизитФормыВЗначение("Объект", Тип("СправочникОбъект.ДанныеДляДоступаНаСайт"));
	//
	//Если НЕ СправочникОбъект.ПроверкаСуществованияКаталога() Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//ЗначениеВРеквизитФормы(СправочникОбъект, "Объект");
	
КонецПроцедуры // ПроверитьНаличиеКаталога()
